In [5]:
import pandas as pd
data = pd.read_csv('demographic.csv')
data

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [11]:
print(len(data))
print(len(data.columns))
print(data.loc[0])

195
5
Country Name            Aruba
Country Code              ABW
Birth rate             10.244
Internet users           78.9
Income Group      High income
Name: 0, dtype: object

In [12]:
data.head(2)
data.tail(2)

    Country Name Country Code  Birth rate  Internet users         Income Group
193       Zambia          ZMB      40.471            15.4  Lower middle income
194     Zimbabwe          ZWE      35.715            18.5           Low income

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [16]:
data.describe() #data.describe().transpose()

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [60]:
data = data.rename(columns={ "Birth rate": "BirthRate", 
"Internet users": "InternetUsers",
"Country Name": "CountryName",
"Country Code": "CountryCode",
"Income Group": "IncomeGroup"
})

In [61]:
data[20:26]
data[26:20:-1]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
26,Brunei Darussalam,BRN,16.405,64.50,High income
25,Barbados,BRB,12.188,73.00,High income
24,Brazil,BRA,14.931,51.04,Upper middle income
23,Bolivia,BOL,24.236,36.94,Lower middle income
22,Bermuda,BMU,10.400,95.30,High income
21,Belize,BLZ,23.092,33.60,Upper middle income

In [62]:
data[::20]

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0         Aruba         ABW     10.244        78.9000          High income
20      Belarus         BLR     12.500        54.1700  Upper middle income
40   Costa Rica         CRI     15.022        45.9600  Upper middle income
60        Gabon         GAB     30.555         9.2000  Upper middle income
80        India         IND     20.291        15.1000  Lower middle income
100       Libya         LBY     21.425        16.5000  Upper middle income
120  Mozambique         MOZ     39.705         5.4000           Low income
140      Poland         POL      9.600        62.8492          High income
160    Suriname         SUR     18.455        37.4000  Upper middle income
180     Uruguay         URY     14.374        57.6900          High income

In [70]:
data['CountryName'].head() # Call one column using string

0                   Aruba
1             Afghanistan
2                  Angola
3                 Albania
4    United Arab Emirates
Name: CountryName, dtype: object

In [71]:
data[['IncomeGroup', 'CountryName']].head() # Call more than one column using List of string

           IncomeGroup           CountryName
0          High income                 Aruba
1           Low income           Afghanistan
2  Upper middle income                Angola
3  Upper middle income               Albania
4          High income  United Arab Emirates

In [66]:
data.BirthRate.head()

0    10.244
1    35.253
2    45.985
3    12.877
4    11.044
Name: BirthRate, dtype: float64

In [67]:
data.IncomeGroup[20:26]

20    Upper middle income
21    Upper middle income
22            High income
23    Lower middle income
24    Upper middle income
25            High income
Name: IncomeGroup, dtype: object

In [86]:
dataMultiply = data[16:26][['CountryName', 'BirthRate']]
dataMultiply['SquareBirth'] = round(dataMultiply.BirthRate ** 2)
dataMultiply

               CountryName  BirthRate  SquareBirth
16                Bulgaria      9.200         85.0
17                 Bahrain     15.040        226.0
18            Bahamas, The     15.339        235.0
19  Bosnia and Herzegovina      9.062         82.0
20                 Belarus     12.500        156.0
21                  Belize     23.092        533.0
22                 Bermuda     10.400        108.0
23                 Bolivia     24.236        587.0
24                  Brazil     14.931        223.0
25                Barbados     12.188        149.0

In [90]:
dataMultiply['CountryName'].str.contains('Brazil')

16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24     True
25    False
Name: CountryName, dtype: bool

In [91]:
dataMultiply[dataMultiply['CountryName'].str.contains('Brazil')]

   CountryName  BirthRate  SquareBirth
24      Brazil     14.931        223.0